libs/DiFeliceDrag/testcase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     denseParticleFoam;

startFrom        latestTime;

startTime       0;

stopAt          endTime;

endTime     180;

deltaT         6e-4;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   9;

runTimeModifiable yes;

adjustTimeStep   no;

maxCo         0.85;

//maxDeltaT       1;

libs ("libuserLagrangianParcel.so");



// ************************************************************************* //
