libs/DiFeliceDrag/testcase/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(0.01601733240434926 0.0004956696983204221 0.00024193548387096774)
(0.01601733240434926 0.0004956696983204221 0.0007258064516129032)
(0.01601733240434926 0.0004956696983204221 0.0012096774193548388)
(0.01601733240434926 0.0004956696983204221 0.0016935483870967741)
(0.01601733240434926 0.0004956696983204221 0.0021774193548387095)
(0.01601733240434926 0.0004956696983204221 0.002661290322580645)
(0.01601733240434926 0.0004956696983204221 0.0031451612903225803)
(0.01601733240434926 0.0004956696983204221 0.003629032258064516)
(0.01601733240434926 0.0004956696983204221 0.004112903225806452)
(0.01601733240434926 0.0004956696983204221 0.004596774193548387)
(0.01601733240434926 0.0004956696983204221 0.005080645161290323)
(0.01601733240434926 0.0004956696983204221 0.005564516129032258)
(0.01601733240434926 0.0004956696983204221 0.006048387096774193)
(0.01601733240434926 0.0004956696983204221 0.006532258064516129)
(0.01601733240434926 0.0004956696983204221 0.0070161290322580646)
(0.01601733240434926 0.0004956696983204221 0.007500000000000001)
(0.01601733240434926 0.0004956696983204221 0.007983870967741936)
(0.01601733240434926 0.0004956696983204221 0.008467741935483872)
(0.01601733240434926 0.0004956696983204221 0.008951612903225806)
(0.01601733240434926 0.0004956696983204221 0.009435483870967742)
(0.01601733240434926 0.0004956696983204221 0.009919354838709678)
(0.01601733240434926 0.0004956696983204221 0.010403225806451612)
(0.01601733240434926 0.0004956696983204221 0.010887096774193548)
(0.01601733240434926 0.0004956696983204221 0.011370967741935484)
(0.01601733240434926 0.0004956696983204221 0.011854838709677419)
(0.01601733240434926 0.0004956696983204221 0.012338709677419355)
(0.01601733240434926 0.0004956696983204221 0.01282258064516129)
(0.01601733240434926 0.0004956696983204221 0.013306451612903227)
(0.01601733240434926 0.0004956696983204221 0.013790322580645161)
(0.01601733240434926 0.0004956696983204221 0.014274193548387097)
(0.01601733240434926 0.0004956696983204221 0.014758064516129033)
(0.01599433687998287 0.0009908650618877888 0.00024193548387096774)
(0.01599433687998287 0.0009908650618877888 0.0007258064516129032)
(0.01599433687998287 0.0009908650618877888 0.0012096774193548388)
(0.01599433687998287 0.0009908650618877888 0.0016935483870967741)
(0.01599433687998287 0.0009908650618877888 0.0021774193548387095)
(0.01599433687998287 0.0009908650618877888 0.002661290322580645)
(0.01599433687998287 0.0009908650618877888 0.0031451612903225803)
(0.01599433687998287 0.0009908650618877888 0.003629032258064516)
(0.01599433687998287 0.0009908650618877888 0.004112903225806452)
(0.01599433687998287 0.0009908650618877888 0.004596774193548387)
(0.01599433687998287 0.0009908650618877888 0.005080645161290323)
(0.01599433687998287 0.0009908650618877888 0.005564516129032258)
(0.01599433687998287 0.0009908650618877888 0.006048387096774193)
(0.01599433687998287 0.0009908650618877888 0.006532258064516129)
(0.01599433687998287 0.0009908650618877888 0.0070161290322580646)
(0.01599433687998287 0.0009908650618877888 0.007500000000000001)
(0.01599433687998287 0.0009908650618877888 0.007983870967741936)
(0.01599433687998287 0.0009908650618877888 0.008467741935483872)
(0.01599433687998287 0.0009908650618877888 0.008951612903225806)
(0.01599433687998287 0.0009908650618877888 0.009435483870967742)
(0.01599433687998287 0.0009908650618877888 0.009919354838709678)
(0.01599433687998287 0.0009908650618877888 0.010403225806451612)
(0.01599433687998287 0.0009908650618877888 0.010887096774193548)
(0.01599433687998287 0.0009908650618877888 0.011370967741935484)
(0.01599433687998287 0.0009908650618877888 0.011854838709677419)
(0.01599433687998287 0.0009908650618877888 0.012338709677419355)
(0.01599433687998287 0.0009908650618877888 0.01282258064516129)
(0.01599433687998287 0.0009908650618877888 0.013306451612903227)
(0.01599433687998287 0.0009908650618877888 0.013790322580645161)
(0.01599433687998287 0.0009908650618877888 0.014274193548387097)
(0.01599433687998287 0.0009908650618877888 0.014758064516129033)
(0.01595603545763651 0.0014851122098671651 0.00024193548387096774)
(0.01595603545763651 0.0014851122098671651 0.0007258064516129032)
(0.01595603545763651 0.0014851122098671651 0.0012096774193548388)
(0.01595603545763651 0.0014851122098671651 0.0016935483870967741)
(0.01595603545763651 0.0014851122098671651 0.0021774193548387095)
(0.01595603545763651 0.0014851122098671651 0.002661290322580645)
(0.01595603545763651 0.0014851122098671651 0.0031451612903225803)
(0.01595603545763651 0.0014851122098671651 0.003629032258064516)
(0.01595603545763651 0.0014851122098671651 0.004112903225806452)
(0.01595603545763651 0.0014851122098671651 0.004596774193548387)
(0.01595603545763651 0.0014851122098671651 0.005080645161290323)
(0.01595603545763651 0.0014851122098671651 0.005564516129032258)
(0.01595603545763651 0.0014851122098671651 0.006048387096774193)
(0.01595603545763651 0.0014851122098671651 0.006532258064516129)
(0.01595603545763651 0.0014851122098671651 0.0070161290322580646)
(0.01595603545763651 0.0014851122098671651 0.007500000000000001)
(0.01595603545763651 0.0014851122098671651 0.007983870967741936)
(0.01595603545763651 0.0014851122098671651 0.008467741935483872)
(0.01595603545763651 0.0014851122098671651 0.008951612903225806)
(0.01595603545763651 0.0014851122098671651 0.009435483870967742)
(0.01595603545763651 0.0014851122098671651 0.009919354838709678)
(0.01595603545763651 0.0014851122098671651 0.010403225806451612)
(0.01595603545763651 0.0014851122098671651 0.010887096774193548)
(0.01595603545763651 0.0014851122098671651 0.011370967741935484)
(0.01595603545763651 0.0014851122098671651 0.011854838709677419)
(0.01595603545763651 0.0014851122098671651 0.012338709677419355)
(0.01595603545763651 0.0014851122098671651 0.01282258064516129)
(0.01595603545763651 0.0014851122098671651 0.013306451612903227)
(0.01595603545763651 0.0014851122098671651 0.013790322580645161)
(0.01595603545763651 0.0014851122098671651 0.014274193548387097)
(0.01595603545763651 0.0014851122098671651 0.014758064516129033)
(0.015902464790137197 0.0019779381688254777 0.00024193548387096774)
(0.015902464790137197 0.0019779381688254777 0.0007258064516129032)
(0.015902464790137197 0.0019779381688254777 0.0012096774193548388)
(0.015902464790137197 0.0019779381688254777 0.0016935483870967741)
(0.015902464790137197 0.0019779381688254777 0.0021774193548387095)
(0.015902464790137197 0.0019779381688254777 0.002661290322580645)
...
(0.017015090215475592 -0.0005808018685203726 0.014758064516129033)
)// ************************************************************************* //
