libs/DiFeliceDrag/testcase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// %%%%%%%%%%%%%%%%%%%%%%%% internalField  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

internalField   uniform 0;

// %%%%%%%%%%%%%%%%%%%%%%%% boundaryField  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

boundaryField
{

//------------------------- movingWallOut ----------------------------------
	movingWallOut
{
        type	zeroGradient;
}
//------------------------- movingWallIn ----------------------------------
	movingWallIn
{
        type	zeroGradient;
}
//------------------------- top -------------------------------------------
	top
{
        type	cyclic;
}
//------------------------- bottom ----------------------------------------
	bottom
{
        type	cyclic;
}       
//------------------------- frontAndBack ----------------------------------      
	frontAndBack
{
        type	empty;
}
// ************************************************************************* //
