libs/DiFeliceDrag/testcase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(alphaPhi.air,U.air)           Gauss linear; //Gauss limitedLinearV 1;//    // Gauss upwind;//Gauss linearUpwindV unlimited;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div(((alpha.air*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;

    div(phiGByA,cloud:alpha)       Gauss linear; //Gauss limitedLinear 1; //Gauss upwind;  //
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
