libs/DiFeliceDrag/testcase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.air
    {
        max             0.99;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        //solver          GAMG;
        //tolerance       1e-06;
        //relTol          0;
       // smoother        GaussSeidel;
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    U.air
    {
        solver        PBiCGStab;  //smoothSolver;
       // smoother        symGaussSeidel;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    U.airFinal
    {
       
       // solver          smoothSolver;
       //smoother        symGaussSeidel;
        //tolerance       1e-05;
        //relTol          0;
       
       solver        PBiCGStab;  //smoothSolver;
       // smoother        symGaussSeidel;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

   
    cloud:alpha
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
    
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
     p           1e-2;
     U.air  		1e-4;
}

relaxationFactors   //importate option ( if put 1 means just uses under-relaxation to ensure matrix diagonal equality, typical of transient simulations)
{
// ------------------------------------------------------------------------------
    fields
{
        p               0.3;
}
// ------------------------------------------------------------------------------
	equations
{
        U.air              0.7;//0.7;//0.5;
}
// ------------------------------------------------------------------------------
}  

// %%%%%%%%%%%%%%%%%%%%%%%%%% residualControl %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//residualControl
//{
   // p           1e-2;
    //U  1e-4;
//}
}


// ************************************************************************* //
