libs/DiFeliceDrag/testcase/system/block
r     0.016;
gapeD      0.0015;
lenght    0.015;
sizeOfMesh 0.00047; 
Re   83; 
rho  1190;
mu    0.0078;



